export default {
  required: 'Обязательное поле',
  invalidEmail: 'Введите правильный адрес электронной почты',
  passwordMinLength: 'Пароль должен содержать не менее 6 символов',
  passwordMinLength12: 'Пароль должен содержать не менее 12 символов',
  passwordComplexity: 'Пароль должен содержать хотя бы одну заглавную букву, одну строчную букву, одну цифру и один специальный символ',
  passwordHint12: 'Должен содержать не менее 12 символов, включая заглавные и строчные буквы, цифру и специальный символ',
  passwordsDoNotMatch: 'Пароли не совпадают',
  nameMinLength: 'Имя должно содержать не менее 2 символов',
  confirmPasswordRequired: 'Пожалуйста, подтвердите ваш пароль',
  passwordRequired: 'Требуется пароль',
};