export default {
  required: 'აუცილებელია',
  invalidEmail: 'შეიყვანეთ სწორი ელექტრონული ფოსტის მისამართი',
  passwordMinLength: 'პაროლი უნდა შეიცავდეს მინიმუმ 6 სიმბოლოს',
  passwordMinLength12: 'პაროლი უნდა შეიცავდეს მინიმუმ 12 სიმბოლოს',
  passwordComplexity: 'პაროლი უნდა შეიცავდეს მინიმუმ ერთ დიდ ასოს, ერთ პატარა ასოს, ერთ რიცხვს და ერთ სპეციალურ სიმბოლოს',
  passwordHint12: 'უნდა იყოს მინიმუმ 12 სიმბოლო, დიდი და პატარა ასოებით, რიცხვით და სპეციალური სიმბოლოთი',
  passwordsDoNotMatch: 'პაროლები არ ემთხვევა',
  nameMinLength: 'სახელი უნდა შეიცავდეს მინიმუმ 2 სიმბოლოს',
  confirmPasswordRequired: 'გთხოვთ დაადასტუროთ თქვენი პაროლი',
  passwordRequired: 'პაროლი სავალდებულოა',
};